[
    {
        "codigo": 1,
        "nome": "Apple iPhone 11 128GB Branco",
        "marca": "Apple",
        "modelo": "iPhone 11",
        "cor": "Branco",
        "memoriaInterna": 128,
        "memoriaRam": 4,
        "tela": 6.1,
        "descritivo": "Grave vídeos 4K, faça belos retratos e capture paisagens inteiras com o novo sistema de câmera dupla. Tire fotos incríveis com pouca luz usando o modo Noite. Veja cores fiéis em fotos, vídeos e jogos na tela Liquid Retina de 6.1 polegadas. Leve o desempenho sem precedentes do chip A13 Bionic para seus games, realidade aumentada e fotografia. Faça muito e recarregue pouco com a bateria para o dia todo. E conte com resistência à água de até dois metros por até 30 minutos.",
        "valor": 2549.99,
        "valorPromo": 2400.0,
        "destaque": false,
        "estoque": 50
    },
    {
        "codigo": 2,
        "nome": "Motorola Moto G22 128GB Preto",
        "marca": "Motorola",
        "modelo": "Moto G22",
        "cor": "Preto",
        "memoriaInterna": 128,
        "memoriaRam": 4,
        "tela": 6.5,
        "descritivo": "Conecte-se ao que há de melhor da tecnologia com o Smartphone Motorola Moto g22 128GB Preto 4G Tela 6,5\" IPS 90Hz Câmera Quadrupla 50MP Selfie 16MP Dual Chip Android 12. O Motorola Moto g22 é um dos smartphones Android mais completos do mercado. Surpreenda-se com a qualidade das imagens com sua tela Touchscreen de 6.5 polegadas, que coloca este modelo de Motorola no topo de sua categoria, com alta resolução de 1600x720 pixel e muito mais! Uma das grandes vantagens do Moto g22 é a sua memória interna de 128 GB com a possibilidade de expansão através de cartão de memória Micro SD de até 1TB. Outro diferencial do Motorola Moto g22 é sua câmera de 50 megapixels que permite ao smartphone capturar imagens incríveis com uma resolução de 8165x6124 pixels e gravar vídeos em alta definição (Full HD) com uma resolução de 1920x1080 pixels. Além disso, sua câmera de selfie de 16 MP permite que seus cliques saiam perfeitos para postar nas redes sociais e possui capacidade de adquirir 12 horas de bateria com apenas 30 minutos de carga através do carregador TurboPower™ 20.",
        "valor": 739.99,
        "valorPromo": 0.0,
        "destaque": false,
        "estoque": 0
    },
    {
        "codigo": 3,
        "nome": "Xiaomi Redmi 13C 256GB Azul",
        "marca": "Xiaomi",
        "modelo": "Redmi 13C",
        "cor": "Azul",
        "memoriaInterna": 256,
        "memoriaRam": 8,
        "tela": 6.74,
        "descritivo": "A Xiaomi traz um celular perfeito para você que busca velocidade, design e tecnologia. O smartphone Xiaomi Redmi 13C Azul possui processador Octa-core MediaTek Helio G85, armazenamento interno de 256GB, 8GB de RAM: abra aplicativos, jogos e muito mais com velocidade, eficiência e qualidade. Ideal para usuários que buscam um celular ágil e fluido para o dia a dia. Um conjunto de câmeras poderoso: a câmera tripla traseira conta principal de 50MP e recurso de inteligência artificial para tornar suas fotos ainda mais impressionantes. Suas fotos ainda mais vibrantes. E mais! Impressionante tela de alta definição com 6,74 polegadas e 90Hz. Experiência visual envolvente com taxa de atualização de 90Hz que garante fluidez e suavidade. Ideal para usar apps, jogar e assistir vídeos com qualidade. E para não ficar desconectado, conta com bateria de 5000mAh, é possível ficar horas conectado sem precisar recarregar por longos períodos, durando sem esforço até um dia inteiro de uso prolongado. O Redmi 13C também suporta carregamento rápido de até 18W. Adquira já o seu Xiaomi Redmi 13C Azul e tenha uma experiência incrível.",
        "valor": 1650.0,
        "valorPromo": 1490.99,
        "destaque": true,
        "estoque": 45
    },
    {
        "codigo": 4,
        "nome": "Samsung Galaxy S24 256GB Cinza",
        "marca": "Samsung",
        "modelo": "Galaxy S24",
        "cor": "Cinza",
        "memoriaInterna": 256,
        "memoriaRam": 8,
        "tela": 6.2,
        "descritivo": "O Galaxy S24 cinza é o smartphone mais recente da Samsung, e ele vem com uma série de recursos impressionantes. O primeiro é a tela infinita Dynamic AMOLED 2X de 6,2\", que tem uma taxa de atualização de 1-120Hz. Isso significa que a tela pode se adaptar ao conteúdo que você está assistindo, fornecendo uma experiência de visualização mais suave e responsiva. Possui câmera traseira tripla de 50MP + 12MP + 10MP, que é capaz de capturar fotos e vídeos de alta qualidade. A câmera frontal de 12MP é perfeita para selfies e videochamadas. É equipado com 256GB de armazenamento interno e 8GB de memória RAM, onde você tem muito espaço para baixar aplicativos, guardar fotos e vídeos. A bateria de 4000mAh oferece energia para o dia todo e o carregamento rápido de 25W, permite recarregá-lo rapidamente quando necessário. Conta com recursos de inteligência artificial, que ajuda você a realizar tarefas, como encontrar informações, controlar dispositivos domésticos inteligentes e traduzir idiomas. Com tecnologia 5G e Dual Chip, você tem acesso a internet em qualquer lugar, sendo Nano-SIM (4FF) e eSIM (O e-SIM requer um plano de dados que pode ter restrições a mudanças de operadora e roaming, mesmo após o término do contrato. Consulte sua operadora para obter mais detalhes). Com Tradução simultânea, obtenha uma tradução rápida ao idioma na próxima ligação e em mensagens. Circule para pesquisar, seja em fotos ou textos. E o Assistente de Transcrição pode resumir suas gravações de voz. Ele é um smartphone premium que oferece desempenho, recursos e design de última geração. Se você está procurando um telefone que tenha tudo, este é uma ótima opção. Atenção: Produto não acompanha fone de ouvido.",
        "valor": 4199.99,
        "valorPromo": 0.0,
        "destaque": true,
        "estoque": 62
    },
    {
        "codigo": 5,
        "nome": "Apple iPhone 14 128GB Vermelho",
        "marca": "Apple",
        "modelo": "iPhone 14",
        "cor": "Vermelho",
        "memoriaInterna": 128,
        "memoriaRam": 6,
        "tela": 6.1,
        "descritivo": "O iPhone 14 tem o sistema de câmera dupla mais impressionante em um iPhone, para fazer fotos espetaculares em pouca e muita luz. E você ganha tranquilidade com nosso novo recurso essencial de segurança. Avisos legais A tela tem bordas arredondadas. Quando medida como um retângulo, a tela tem 6,06 polegadas na diagonal. A área real de visualização é menor. O SOS de Emergência usa uma conexão de rede celular ou chamadas Wi-Fi. A duração da bateria varia de acordo com o uso e a configuração. Consulte apple.com/br/batteries para obter mais informações. É preciso ter um plano de dados. 5G só está disponível em alguns países e por meio de determinadas operadoras. As velocidades variam de acordo com as condições e operadoras locais. Para obter detalhes sobre a compatibilidade com 5G, entre em contato com sua operadora e consulte apple.com/br/iphone/cellular. O iPhone 14 é resistente a respingos, água e poeira e foi testado em condições controladas em laboratório, classificado como IP68 segundo a norma IEC 60529 (profundidade máxima de seis metros por até 30 minutos). A resistência a respingos, água e poeira não é uma condição permanente e pode diminuir com o tempo. Não tente recarregar um iPhone molhado. Veja instruções de limpeza e secagem no Manual do Usuário. Danos decorrentes de contato com líquidos não estão incluídos na garantia.",
        "valor": 4500.0,
        "valorPromo": 3899.0,
        "destaque": true,
        "estoque": 3
    },
    {
        "codigo": 6,
        "nome": "Samsung Galaxy A14 128GB Prata",
        "marca": "Samsung",
        "modelo": "Galaxy A14",
        "cor": "Prata",
        "memoriaInterna": 128,
        "memoriaRam": 4,
        "tela": 6.6,
        "descritivo": "Com bateria de 5.000 mAh, a Inovação do Smartphone Samsung Galaxy A14 não termina aí. Com tecnologia 5G, o Galaxy A14 que permite a transferência de dados e excelente navegação na internet, além de conectividade Wi-fi e GPS presente no aparelho. Tem também leitor multimídia, videoconferência e bluetooth. Com tela PLS LCD de 6,6 polegadas, ele chega para revolucionar com suas características inovadoras e se tornando uma ótima opção para qualquer tipo de utilização. Com resolução HD+ e taxa de atualização de 90 Hz, possui mais 16 milhões de cores, dando mais clareza à sua tela. Além das 3 câmeras traseiras com 50 Megapixels de resolução, dando uma vivacidade e qualidade a cada clique. O Samsung Galaxy A14 vem equipado com um processador com oito núcleos, Octa-core, com a velocidade de 2.4GHz, além de possuir uma memória RAM de 4GB e capacidade interna de 128GB e slot para cartões de memória em modelo MicroSD com capacidade de até 1TB. Seu design simples, possui bordas arredondadas e tela infinita, sem botões aparentes ou detalhes que tiram toda a atenção.",
        "valor": 1109.9,
        "valorPromo": 840.99,
        "destaque": false,
        "estoque": 43
    },
    {
        "codigo": 7,
        "nome": "Apple iPhone 13 128GB Verde",
        "marca": "Apple",
        "modelo": "iPhone 13",
        "cor": "Verde",
        "memoriaInterna": 128,
        "memoriaRam": 6,
        "tela": 6.1,
        "descritivo": "O sistema de câmera dupla mais avançado em um iPhone. Chip A15 Bionic com velocidade impressionante. Um grande salto em bateria. Projetado para durar. 5G ultrarrápido. E tela Super Retina XDR mais brilhante. Avisos legais: É preciso ter um plano de dados. 5G só está disponível em alguns países e por meio de determinadas operadoras. As velocidades variam de acordo com as condições e operadoras locais. Para obter detalhes sobre a compatibilidade com 5G, entre em contato com sua operadora e consulte apple.com/br/iphone/cellular. A tela tem bordas arredondadas que se ajustam ao design curvo do aparelho dentro da sua forma retangular. Quando medida como um retângulo, a tela tem 6,06 polegadas na diagonal. A área real de visualização é menor. A duração da bateria varia de acordo com o uso e a configuração. Consulte apple.com/br/batteries para obter mais informações. O iPhone 13 é resistente a respingos, água e poeira e foi testado em condições controladas em laboratório, classificado como IP68 segundo a norma IEC 60529. A resistência a respingos, água e poeira não é uma condição permanente e pode diminuir com o tempo. Não tente recarregar um iPhone molhado. Veja instruções de limpeza e secagem no Manual do Usuário. Danos decorrentes de contato com líquidos não estão incluídos na garantia. Alguns recursos podem não estar disponíveis em todos os países ou regiões. Os acessórios são vendidos separadamente.",
        "valor": 3699.9,
        "valorPromo": 3400.0,
        "destaque": true,
        "estoque": 0
    },
    {
        "codigo": 8,
        "nome": "Samsung Galaxy S21 128GB Preto",
        "marca": "Samsung",
        "modelo": "Galaxy S21",
        "cor": "Preto",
        "memoriaInterna": 128,
        "memoriaRam": 8,
        "tela": 6.2,
        "descritivo": "O Samsung Galaxy S21 é um smartphone premium que combina tecnologia de ponta e design sofisticado. A tela Dynamic AMOLED 2X de 6,2 polegadas oferece cores vibrantes e contraste excepcional, proporcionando uma experiência visual imersiva. Equipado com o avançado processador Exynos 2100, o Galaxy S21 garante desempenho superior em multitarefas, jogos e streaming. A câmera traseira tripla, composta por sensores de 64MP, 12MP e 12MP, permite capturar fotos de altíssima qualidade com detalhes nítidos e cores vivas. Recursos como o Modo Noturno e a estabilização óptica de imagem garantem fotos incríveis mesmo em condições de pouca luz. A gravação de vídeos em 8K captura momentos com uma clareza surpreendente. A bateria de 4000mAh oferece autonomia para um dia inteiro de uso intenso, e o suporte para carregamento rápido de 25W e carregamento sem fio mantém você conectado sem longas esperas. Além disso, o Galaxy S21 possui certificação IP68, tornando-o resistente à água e poeira, e um design elegante em preto que complementa qualquer estilo.",
        "valor": 1414.1,
        "valorPromo": 0.0,
        "destaque": false,
        "estoque": 33
    },
    {
        "codigo": 9,
        "nome": "Xiaomi Poco X6 256GB Branco",
        "marca": "Xiaomi",
        "modelo": "Poco X6",
        "cor": "Branco",
        "memoriaInterna": 256,
        "memoriaRam": 8,
        "tela": 6.67,
        "descritivo": "Desfrute de uma experiência cinematográfica com o Xiaomi Poco X6. A tela AMOLED de 6,67 polegadas, com resolução de 1,5K e taxa de atualização de 120Hz, proporciona cores vibrantes e uma fluidez incrível, ideal para gamers e entusiastas de filmes. Equipado com Dolby Vision e Dolby Atmos, este dispositivo oferece uma qualidade visual e sonora imersiva que transforma qualquer conteúdo em uma experiência envolvente.Capture momentos inesquecíveis com a câmera de alta resolução de 64MP, que vem acompanhada de um conjunto de lentes avançadas para garantir fotos e vídeos deslumbrantes em qualquer situação. A estabilização de imagem garante que suas imagens permaneçam nítidas e claras, mesmo em movimento.O Xiaomi Poco X6 é alimentado pelo novo processador Snapdragon 7s Gen 2, garantindo um desempenho poderoso e uma experiência rápida e fluida, capaz de enfrentar qualquer desafio, desde aplicativos diários até jogos intensos. Com uma bateria de 5000mAh, você pode desfrutar de longas sessões de jogos e uso diário sem se preocupar com a recarga. E quando precisar, o carregamento turbo de 67W recarrega o aparelho extremamente rápido, mantendo você conectado o tempo todo.",
        "valor": 2099.0,
        "valorPromo": 1698.69,
        "destaque": false,
        "estoque": 16
    },
    {
        "codigo": 10,
        "nome": "Motorola Moto G53 128GB Grafite",
        "marca": "Motorola",
        "modelo": "Moto G53",
        "cor": "Grafite",
        "memoriaInterna": 128,
        "memoriaRam": 4,
        "tela": 6.5,
        "descritivo": "Seu próximo smartphone Motorola vai ser o Moto G53 com tecnologia 5G, que oferece uma experiência de navegação ultrarrápida e conectividade inigualável. O design marcante do Moto G53 conta com uma proteção em alumínio ao redor da câmera, proporcionando maior durabilidade e resistência. As bordas finas na parte frontal oferecem uma visão mais ampla e imersiva na tela de 6,5 polegadas, ideal para assistir vídeos, jogar e navegar na internet com qualidade. A câmera traseira de 50 Megapixels garante alta qualidade em todas as suas fotos, capturando detalhes nítidos e cores vibrantes, mesmo em condições de pouca luz. Seja de dia ou de noite, suas fotos ficarão espetaculares, permitindo que você registre cada momento com perfeição. A bateria de 5000 mAh do Moto G53 oferece uma durabilidade impressionante, acompanhando você o dia inteiro sem precisar se preocupar com recargas frequentes. E quando for necessário carregar, o Carregador Turbopower incluído permite que você recarregue o dispositivo três vezes mais rápido do que um carregador comum, garantindo que você volte à ação rapidamente. Combinando design sofisticado, desempenho robusto e recursos avançados, o Motorola Moto G53 é uma excelente escolha para quem busca um smartphone que oferece tudo o que é necessário para o dia a dia e muito mais.",
        "valor": 1329.99,
        "valorPromo": 0.0,
        "destaque": true,
        "estoque": 34
    }
]